veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxCan_reg.h
/** \brief 6C0, Tx Buffer Configuration 1 */
#define CAN1_N1_TX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF02186C0u)
/** Alias (User Manual Name) for CAN1_N1_TX_BC.
* To use register names with standard convension, please use CAN1_N1_TX_BC.
*/
#define CAN1_TXBC1 (CAN1_N1_TX_BC)

/** \brief 6C4, Tx FIFO/Queue Status 1 */
#define CAN1_N1_TX_FQS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF02186C4u)
/** Alias (User Manual Name) for CAN1_N1_TX_FQS.
* To use register names with standard convension, please use CAN1_N1_TX_FQS.
*/
#define CAN1_TXFQS1 (CAN1_N1_TX_FQS)

/** \brief 6C8, Tx Buffer Element Size Configuration 1 */
#define CAN1_N1_TX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF02186C8u)
/** Alias (User Manual Name) for CAN1_N1_TX_ESC.
* To use register names with standard convension, please use CAN1_N1_TX_ESC.
*/
#define CAN1_TXESC1 (CAN1_N1_TX_ESC)

/** \brief 6CC, Tx Buffer Request Pending 1 */
#define CAN1_N1_TX_BRP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF02186CCu)
/** Alias (User Manual Name) for CAN1_N1_TX_BRP.
* To use register names with standard convension, please use CAN1_N1_TX_BRP.
*/
#define CAN1_TXBRP1 (CAN1_N1_TX_BRP)

/** \brief 6D0, Tx Buffer Add Request 1 */
#define CAN1_N1_TX_BAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF02186D0u)
/** Alias (User Manual Name) for CAN1_N1_TX_BAR.
* To use register names with standard convension, please use CAN1_N1_TX_BAR.
*/
#define CAN1_TXBAR1 (CAN1_N1_TX_BAR)

/** \brief 6D4, Tx Buffer Cancellation Request 1 */
#define CAN1_N1_TX_BCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF02186D4u)
/** Alias (User Manual Name) for CAN1_N1_TX_BCR.
* To use register names with standard convension, please use CAN1_N1_TX_BCR.
*/
#define CAN1_TXBCR1 (CAN1_N1_TX_BCR)

/** \brief 6D8, Tx Buffer Transmission Occurred 1 */
#define CAN1_N1_TX_BTO /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF02186D8u)
/** Alias (User Manual Name) for CAN1_N1_TX_BTO.
* To use register names with standard convension, please use CAN1_N1_TX_BTO.
*/
#define CAN1_TXBTO1 (CAN1_N1_TX_BTO)

/** \brief 6DC, Tx Buffer Cancellation Finished 1 */
#define CAN1_N1_TX_BCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF02186DCu)
/** Alias (User Manual Name) for CAN1_N1_TX_BCF.
* To use register names with standard convension, please use CAN1_N1_TX_BCF.
*/
#define CAN1_TXBCF1 (CAN1_N1_TX_BCF)

/** \brief 6E0, Tx Buffer Transmission Interrupt Enable 1 */
#define CAN1_N1_TX_BTIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF02186E0u)
/** Alias (User Manual Name) for CAN1_N1_TX_BTIE.
* To use register names with standard convension, please use CAN1_N1_TX_BTIE.
*/
#define CAN1_TXBTIE1 (CAN1_N1_TX_BTIE)

/** \brief 6E4, Tx Buffer Cancellation Finished Interrupt Enable 1 */
#define CAN1_N1_TX_BCIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF02186E4u)
/** Alias (User Manual Name) for CAN1_N1_TX_BCIE.
* To use register names with standard convension, please use CAN1_N1_TX_BCIE.
*/
#define CAN1_TXBCIE1 (CAN1_N1_TX_BCIE)

/** \brief 6F0, Tx Event FIFO Configuration 1 */
#define CAN1_N1_TX_EFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF02186F0u)
/** Alias (User Manual Name) for CAN1_N1_TX_EFC.
* To use register names with standard convension, please use CAN1_N1_TX_EFC.
*/
#define CAN1_TXEFC1 (CAN1_N1_TX_EFC)

/** \brief 6F4, Tx Event FIFO Status 1 */
#define CAN1_N1_TX_EFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF02186F4u)
/** Alias (User Manual Name) for CAN1_N1_TX_EFS.
* To use register names with standard convension, please use CAN1_N1_TX_EFS.
*/
#define CAN1_TXEFS1 (CAN1_N1_TX_EFS)

/** \brief 6F8, Tx Event FIFO Acknowledge 1 */
#define CAN1_N1_TX_EFA /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF02186F8u)
/** Alias (User Manual Name) for CAN1_N1_TX_EFA.
* To use register names with standard convension, please use CAN1_N1_TX_EFA.
*/
#define CAN1_TXEFA1 (CAN1_N1_TX_EFA)

/** \brief 900, Access Enable Register CAN Node 2 0 */
#define CAN1_N2_ACCENNODE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ACCENNODE0*)0xF0218900u)
/** Alias (User Manual Name) for CAN1_N2_ACCENNODE0.
* To use register names with standard convension, please use CAN1_N2_ACCENNODE0.
*/
#define CAN1_ACCENNODE20 (CAN1_N2_ACCENNODE0)

/** \brief 908, Start Address Node 2 */
#define CAN1_N2_STARTADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0218908u)
/** Alias (User Manual Name) for CAN1_N2_STARTADR.
* To use register names with standard convension, please use CAN1_N2_STARTADR.
*/
#define CAN1_STARTADR2 (CAN1_N2_STARTADR)

/** \brief 90C, End Address Node 2 */
#define CAN1_N2_ENDADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF021890Cu)
/** Alias (User Manual Name) for CAN1_N2_ENDADR.
* To use register names with standard convension, please use CAN1_N2_ENDADR.
*/
#define CAN1_ENDADR2 (CAN1_N2_ENDADR)

/** \brief 910, Interrupt Signalling Register 2 */
#define CAN1_N2_ISREG /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0218910u)
/** Alias (User Manual Name) for CAN1_N2_ISREG.
* To use register names with standard convension, please use CAN1_N2_ISREG.
*/
#define CAN1_ISREG2 (CAN1_N2_ISREG)

/** \brief 914, Interrupt routing for Groups 1 2 */
#define CAN1_N2_GRINT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT1*)0xF0218914u)
/** Alias (User Manual Name) for CAN1_N2_GRINT1.
* To use register names with standard convension, please use CAN1_N2_GRINT1.
*/
#define CAN1_GRINT12 (CAN1_N2_GRINT1)

/** \brief 918, Interrupt routing for Groups 2 2 */
#define CAN1_N2_GRINT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT2*)0xF0218918u)
/** Alias (User Manual Name) for CAN1_N2_GRINT2.
* To use register names with standard convension, please use CAN1_N2_GRINT2.
*/
#define CAN1_GRINT22 (CAN1_N2_GRINT2)

/** \brief 920, Node 2 Timer Clock Control Register */
#define CAN1_N2_NT_CCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0218920u)
/** Alias (User Manual Name) for CAN1_N2_NT_CCR.
* To use register names with standard convension, please use CAN1_N2_NT_CCR.
*/
#define CAN1_NTCCR2 (CAN1_N2_NT_CCR)

/** \brief 924, Node 2 Timer A Transmit Trigger Register */
#define CAN1_N2_NT_ATTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0218924u)
/** Alias (User Manual Name) for CAN1_N2_NT_ATTR.
* To use register names with standard convension, please use CAN1_N2_NT_ATTR.
*/
#define CAN1_NTATTR2 (CAN1_N2_NT_ATTR)

/** \brief 928, Node 2 Timer B Transmit Trigger Register */
#define CAN1_N2_NT_BTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0218928u)
/** Alias (User Manual Name) for CAN1_N2_NT_BTTR.
* To use register names with standard convension, please use CAN1_N2_NT_BTTR.
*/
#define CAN1_NTBTTR2 (CAN1_N2_NT_BTTR)

/** \brief 92C, Node 2 Timer C Transmit Trigger Register */
#define CAN1_N2_NT_CTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF021892Cu)
/** Alias (User Manual Name) for CAN1_N2_NT_CTTR.
* To use register names with standard convension, please use CAN1_N2_NT_CTTR.
*/
#define CAN1_NTCTTR2 (CAN1_N2_NT_CTTR)

